In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter

In [3]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(5)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
546,tt0211443,11000000,16000000,Jason X,Kane Hodder|Lexa Doig|Chuck Campbell|Lisa Ryde...,James Isaac,Evil has an upgrade.,"In the year 2455, Old Earth is now a contamina...",91,Horror|Science Fiction,New Line Cinema|Sean S. Cunningham Films|Cryst...,7/24/2001,4.3,2001
108,tt3077214,14000000,16002420,Suffragette,Carey Mulligan|Helena Bonham Carter|Meryl Stre...,Sarah Gavron,Mothers. Daughters. Rebels.,Based on true events about the foot soldiers o...,106,Drama|History,Ruby Films|PathÃ©|Film4,10/16/2015,7.1,2015
1307,tt2431286,12000000,100129872,Philomena,Judi Dench|Steve Coogan|Sophie Kennedy Clark|M...,Stephen Frears,These two unlikely companions are on a journey...,"A woman searches for her adult son, who was ta...",98,Drama,BBC Films|The Weinstein Company|Baby Cow Produ...,11/1/2013,7.4,2013
1818,tt0187078,90000000,237202299,Gone In Sixty Seconds,Nicolas Cage|Angelina Jolie|Giovanni Ribisi|De...,Dominic Sena,"Ice Cold, Hot Wired.",Upon learning that he has to come out of retir...,118,Action|Crime|Thriller,Jerry Bruckheimer Films|Touchstone Pictures,6/9/2000,6.0,2000
1798,tt0499554,10000000,20342161,Reno 911!: Miami,Lennie Loftin|Danny DeVito|Ben Garant|Carlos A...,Ben Garant,"In a time of crisis, America will call Reno 911!",A rag-tag team of Reno cops are called in to s...,84,Action|Adventure|Comedy|Crime,20th Century Fox,2/23/2007,5.8,2007

In [114]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [115]:
# создадим словарь для ответов
answers
# тут другие ваши предобработки колонок например:

#the time given in the dataset is in string format.
#So we need to change this in datetime format
# ...

# for task 6: calculate movie profit by substracting budget from revenue and add separate column for 'profit' 
data['profit']=data.revenue-data.budget

# for task 11: in order to determine most popular genre let's use Counter container 
import collections
g=collections.Counter()
e=data.genres # we need to work with 'genres' column
for line in e:
    info=line.split('|') # genres are separated with '|' so we need to split them
    gnr=info[0]
    g[gnr]+=1

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [116]:
# в словарь вставляем номер вопроса и ваш ответ на него
# Пример: 
answers['1'] = '2. Spider-Man 3 (tt0413300)'
# запишите свой вариант ответа
answers['1'] = '5. Pirates of the Caribbean: On Stranger Tides (tt1298650)'
# если ответили верно, можете добавить комментарий со значком "+"

In [8]:
# тут пишем ваш код для решения данного вопроса:
data[['original_title','budget']].sort_values('budget',ascending=False).head()

                                   original_title     budget
723   Pirates of the Caribbean: On Stranger Tides  380000000
1669     Pirates of the Caribbean: At World's End  300000000
14                        Avengers: Age of Ultron  280000000
1014                                  John Carter  260000000
380                                       Tangled  260000000

ВАРИАНТ 2

In [18]:
# можно добавлять разные варианты решения

# 2. Какой из фильмов самый длительный (в минутах)?

In [117]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = '2. Gods and Generals (tt0279111)'

In [159]:
data[['original_title','runtime']].sort_values('runtime',ascending=False).head()

                                     original_title  runtime
1157                              Gods and Generals      214
1081  The Lord of the Rings: The Return of the King      201
1736                                     Grindhouse      191
1336                                      King Kong      187
504                                    Pearl Harbor      183

# 3. Какой из фильмов самый короткий (в минутах)?

In [118]:
answers['3'] = '3. Winnie the Pooh (tt1449283)'

In [161]:
data[['original_title','runtime']].sort_values('runtime').head()

            original_title  runtime
768        Winnie the Pooh       63
930   Return to Never Land       72
1097     The Jungle Book 2       72
1408               Valiant       76
1626     Home on the Range       76

# 4. Какова средняя длительность фильмов?

In [119]:
answers['4'] = '2. 110'

In [77]:
data.runtime.mean()

109.6585494970884

# 5. Каково медианное значение длительности фильмов?

In [120]:
answers['5'] = '1. 107'

In [81]:
data.runtime.median()

107.0

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [121]:
# лучше код получения столбца profit вынести в Предобработку что в начале
answers['6'] = '5. Avatar (tt0499549)'

In [162]:
data[['imdb_id','original_title','profit']].sort_values('profit',ascending=False).head()

       imdb_id                original_title      profit
239  tt0499549                        Avatar  2544505847
3    tt2488496  Star Wars: The Force Awakens  1868178225
0    tt0369610                Jurassic World  1363528810
4    tt2820852                     Furious 7  1316249360
970  tt0848228                  The Avengers  1299557910

# 7. Какой фильм самый убыточный?

In [122]:
answers['7'] = '5. The Lone Ranger (tt1210819)'

In [163]:
data[['imdb_id','original_title','profit']].sort_values('profit').head()

        imdb_id                original_title     profit
1245  tt1210819               The Lone Ranger -165710090
1616  tt0318974                     The Alamo -119180039
809   tt1305591               Mars Needs Moms -111007242
958   tt0180052  The Adventures of Pluto Nash  -92896027
1464  tt0424095                  Flushed Away  -84540684

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [123]:
answers['8'] = '1. 1478'

In [126]:
len(data[data.profit>0])

1478

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [124]:
answers['9'] = '4. The Dark Knight (tt0468569)'

In [165]:
data.query('release_year=="2008"').sort_values('revenue',ascending=False)[['imdb_id','original_title','revenue']].head()

       imdb_id                                     original_title     revenue
599  tt0468569                                    The Dark Knight  1001921825
603  tt0367882  Indiana Jones and the Kingdom of the Crystal S...   786636033
606  tt0441773                                      Kung Fu Panda   631744560
621  tt0448157                                            Hancock   624029371
607  tt0795421                                         Mamma Mia!   609841637

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [125]:
answers['10'] = '5. The Lone Ranger (tt1210819)'

In [167]:
data.query('2012<=release_year<=2014').sort_values('profit')[['imdb_id','original_title','profit']].head()

        imdb_id                   original_title     profit
1245  tt1210819                  The Lone Ranger -165710090
1214  tt0790736                         R.I.P.D.  -68351500
1007  tt1374992                      Upside Down  -51893525
1302  tt0884726  Legends of Oz: Dorothy's Return  -51337973
1235  tt1308729               Bullet to the Head  -45510171

# 11. Какого жанра фильмов больше всего?

In [126]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале
answers['11'] = '3. Drama'

In [4]:
data['genres'].str.cat(sep='|')
pd.Series(data['genres'].str.cat(sep='|').split('|'))
pd.Series(data['genres'].str.cat(sep='|').split('|')).value_counts()

Drama              782
Comedy             683
Thriller           596
Action             582
Adventure          415
Crime              315
Romance            308
Family             260
Science Fiction    248
Fantasy            222
Horror             176
Mystery            168
Animation          139
Music               64
History             62
War                 58
Western             19
Documentary          8
Foreign              2
dtype: int64

ВАРИАНТ 2

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [127]:
answers['12'] = '1. Drama'

In [25]:
data2=data[data.profit>0]
data2['genres'].str.cat(sep='|')
pd.Series(data2['genres'].str.cat(sep='|').split('|'))
pd.Series(data2['genres'].str.cat(sep='|').split('|')).value_counts()

Drama              560
Comedy             551
Thriller           446
Action             444
Adventure          337
Romance            242
Crime              231
Family             226
Science Fiction    195
Fantasy            188
Horror             150
Animation          120
Mystery            119
Music               47
History             46
War                 41
Western             12
Documentary          7
dtype: int64

# 13. У какого режиссера самые большие суммарные кассовые сбооры?

In [128]:
answers['13'] = '5. Peter Jackson'

In [52]:
rev_dir=data.pivot_table(values='revenue',
                index='director',
                aggfunc='sum',
                        fill_value=0)
rev_dir.sort_values('revenue',ascending=False).head()

                      revenue
director
Peter Jackson      6490593685
Christopher Nolan  4167548502
David Yates        4154295625
Michael Bay        3886938960
J.J. Abrams        3579169916

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [129]:
answers['14'] = '3. Robert Rodriguez'

In [66]:
data['list_dirs']=data.director.str.split('|')
data_action=data[data.genres.str.contains('Action')][['list_dirs']]
data_exploided_action=data_action.explode('list_dirs')
data_exploided_action.list_dirs.value_counts()

Robert Rodriguez      9
Michael Bay           7
Paul W.S. Anderson    7
Ridley Scott          6
Antoine Fuqua         6
                     ..
Michael Davis         1
John Whitesell        1
Barry Levinson        1
Sydney Pollack        1
John Luessenhop       1
Name: list_dirs, Length: 364, dtype: int64

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [130]:
answers['15'] = '3. Chris Hemsworth'

In [101]:
data['list_cast']=data.cast.str.split('|')
data_year=data.query('release_year in ["2012"]')
data_exploided_year=data_year.explode('list_cast')
ef=data_exploided_year.pivot_table(values='revenue',
                               index='list_cast',
                               aggfunc='sum',
                               fill_value=0)
ef.sort_values('revenue',ascending=False)

                      revenue
list_cast
Chris Hemsworth    2027450773
Denis Leary        1629460639
Anne Hathaway      1522851057
Robert Downey Jr.  1519557910
Mark Ruffalo       1519557910
...                       ...
Michael Nyqvist       3428048
Danny Huston          2106557
Josh Lucas            2106557
Sami Gayle            2106557
Nicolas Cage          2106557

[466 rows x 1 columns]

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов?

In [131]:
answers['16'] = '3. Matt Damon'

In [97]:
data['list_cast']=data.cast.str.split('|')
data_budget=data[data.budget>data.budget.mean()]
data_exploded_budget=data_budget.explode('list_cast')
tn=data_exploded_budget.pivot_table(values='imdb_id',
                                    index='list_cast',
                                    aggfunc='count',
                                    fill_value=0)
tn.sort_values('imdb_id',ascending=False)

                         imdb_id
list_cast
Matt Damon                    18
Adam Sandler                  17
Angelina Jolie                16
Tom Cruise                    15
Eddie Murphy                  15
...                          ...
Jennifer Hudson                1
Jennifer Jason Leigh           1
Jennifer Saunders              1
Jennifer Tilly                 1
Ã“lafur Darri Ã“lafsson        1

[1505 rows x 1 columns]

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [132]:
answers['17'] = '2. Action'

In [22]:
data['list_cast']=data.cast.str.split('|')
data['new_genres']=data.genres.str.split('|')
cage=data[data.cast.str.contains('Nicolas Cage')]
expl=cage.explode('new_genres')
cage_count=expl.pivot_table(values='imdb_id',
                index='new_genres',
                aggfunc='count',
                fill_value=0)
cage_count.sort_values('imdb_id',ascending=False)

                 imdb_id
new_genres
Action                17
Thriller              15
Drama                 12
Crime                 10
Fantasy                8
Adventure              7
Comedy                 6
Science Fiction        4
Animation              3
Family                 3
Mystery                3
History                2
Horror                 1
Romance                1
War                    1

# 18. Самый убыточный фильм от Paramount Pictures

In [133]:
answers['18'] = '1. K-19: The Widowmaker (tt0267626)'

In [169]:
data[(data.production_companies.str.contains('Paramount Pictures'))&(data.profit<0)].sort_values('profit').head(1)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year,profit
925,tt0267626,100000000,35168966,K-19: The Widowmaker,Harrison Ford|Liam Neeson|Peter Sarsgaard|Joss...,Kathryn Bigelow,Fate has found its hero.,When Russia's first nuclear submarine malfunct...,138,Thriller|Drama|History,Paramount Pictures|Intermedia Films|National G...,7/19/2002,6.0,2002,-64831034

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [134]:
answers['19'] = '5. 2015'

In [170]:
success=data.pivot_table(values='revenue',
                index='release_year',
                aggfunc='sum',
                fill_value=0)
success.sort_values('revenue',ascending=False).head()

                  revenue
release_year
2015          25449202382
2014          23405862953
2013          23213799791
2012          23079001687
2011          22676791872

# 20. Какой самый прибыльный год для студии Warner Bros?

In [135]:
answers['20'] = '1. 2014'

In [171]:
data_warner=data[data.production_companies.str.contains('Warner Bros')]
good_year=data_warner.pivot_table(values='profit',
                       index='release_year',
                       aggfunc='sum',
                       fill_value=0)
good_year.sort_values('profit',ascending=False).head()

                  profit
release_year
2014          2295464519
2007          2201675217
2008          2134595031
2010          1974712985
2011          1871393682

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [136]:
answers['21'] = '4. Сентябрь'

In [137]:
data['release_date'] = pd.to_datetime(data['release_date'])
data.release_date.dt.month.value_counts()

9     227
12    190
10    186
8     161
3     156
4     149
6     147
11    146
7     142
5     140
2     135
1     110
Name: release_date, dtype: int64

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [137]:
answers['22'] = '2. 450'

In [153]:
data['release_date'] = pd.to_datetime(data['release_date'])
len(data[(data.release_date.dt.month==6)|(data.release_date.dt.month==7)|(data.release_date.dt.month==8)])

450

# 23. Для какого режиссера зима – самое продуктивное время года?

In [138]:
answers['23'] = '5. Peter Jackson'

In [41]:
data['release_date'] = pd.to_datetime(data['release_date'])
data['month']=data.release_date.dt.month
data['list_dirs']=data.director.str.split('|')
data_winter=data[(data.month==12)|(data.month==1)|(data.month==2)][['list_dirs']]
data_exploded_winter=data_winter.explode('list_dirs')
data_exploded_winter.list_dirs.value_counts()

Peter Jackson          7
Steven Soderbergh      6
Clint Eastwood         6
Shawn Levy             4
Adam Shankman          4
                      ..
Uwe Boll               1
James Watkins          1
Tommy Wirkola          1
Christopher Spencer    1
MÃ¥ns MÃ¥rlind         1
Name: list_dirs, Length: 358, dtype: int64

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [139]:
answers['24'] = '5. Four By Two Productions'

In [95]:
def counter(movie_bd, x):
    data_plot=movie_bd[x].str.cat(sep='|')
    dat=pd.Series(data_plot.split('|'))
    info=dat.value_counts(ascending=False)
    return info
data['title_words_length'] = data.original_title.map(lambda x: len(x.split(' ')))
sum_gen=counter(data,'production_companies')
for gen in sum_gen.index:
    sum_gen[gen] = data['title_words_length'][data['production_companies'].map(lambda x: True if gen in x else False)].mean()
sum_gen = pd.DataFrame(sum_gen).sort_values(0, ascending=False)

                               0
Four By Two Productions       12
Jim Henson Company, The       10
The Saul Zaentz Company        9
Polsky Films                   9
Dos Corazones                  9
...                           ..
British Film Institute (BFI)   1
Likely Story                   1
Vaughn Productions             1
Gulfstream Pictures            1
Intertainment AG               1

[1771 rows x 1 columns]

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [140]:
answers['25'] = '3. Midnight Picture Show'

In [101]:
def counter(movie, x):
    data1=movie[x].str.cat(sep='|')
    data2=pd.Series(data1.split('|'))
    info=data2.value_counts(ascending=False)
    return info
data['word'] = data.overview.str.split().map(len)
summ = counter(data,'production_companies')
for i in summ.index:
    summ[i] = data['word'][data['production_companies'].map(lambda x: True if i in x else False)].mean()
summ = pd.DataFrame(summ).sort_values(0, ascending=False)

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 

по vote_average

In [141]:
answers['26'] = '1. Inside Out, The Dark Knight, 12 Years a Slave'

In [79]:
data[['original_title','vote_average']].sort_values('vote_average',ascending = False).head(int(len(data['vote_average'])*0.01))

                                     original_title  vote_average
599                                 The Dark Knight           8.1
118                                    Interstellar           8.0
125                              The Imitation Game           8.0
9                                        Inside Out           8.0
34                                             Room           8.0
1183                        The Wolf of Wall Street           7.9
128                                       Gone Girl           7.9
1191                               12 Years a Slave           7.9
119                         Guardians of the Galaxy           7.9
1081  The Lord of the Rings: The Return of the King           7.9
1800                                        Memento           7.9
370                                       Inception           7.9
872                                     The Pianist           7.9
138                        The Grand Budapest Hotel           7.9
1188                                            Her           7.8
28                                        Spotlight           7.8
124                                      Big Hero 6           7.8
177                          The Fault in Our Stars           7.8

ВАРИАНТ 2

In [174]:
top_1_vote = data[data['vote_average'] > data['vote_average'].quantile(0.99)][['vote_average','original_title']].sort_values('vote_average',ascending=False)
display(top_1_vote)

      vote_average                                 original_title
599            8.1                                The Dark Knight
9              8.0                                     Inside Out
34             8.0                                           Room
118            8.0                                   Interstellar
125            8.0                             The Imitation Game
119            7.9                        Guardians of the Galaxy
128            7.9                                      Gone Girl
138            7.9                       The Grand Budapest Hotel
370            7.9                                      Inception
872            7.9                                    The Pianist
1081           7.9  The Lord of the Rings: The Return of the King
1183           7.9                        The Wolf of Wall Street
1191           7.9                               12 Years a Slave
1800           7.9                                        Memento

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [143]:
answers['27'] = '5. Daniel Radcliffe & Rupert Grint'

In [175]:
from itertools import combinations
actor_list = data.cast.str.split('|').tolist()
combo_list=[]
for i in actor_list:
   for j in combinations(i, 2):
       combo_list.append(' '.join(j))
combo_list = pd.DataFrame(combo_list)
combo_list.columns = ['actor_combinations']
combo_list.actor_combinations.value_counts().head(10)

Daniel Radcliffe Rupert Grint       8
Daniel Radcliffe Emma Watson        8
Rupert Grint Emma Watson            7
Johnny Depp Helena Bonham Carter    6
Ben Stiller Owen Wilson             6
Robert Pattinson Taylor Lautner     5
Kristen Stewart Taylor Lautner      5
Kristen Stewart Robert Pattinson    5
Adam Sandler Kevin James            5
Hugh Jackman Ian McKellen           5
Name: actor_combinations, dtype: int64

# Submission

In [176]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': '5. Pirates of the Caribbean: On Stranger Tides (tt1298650)',
 '2': '2. Gods and Generals (tt0279111)',
 '3': '3. Winnie the Pooh (tt1449283)',
 '4': '2. 110',
 '5': '1. 107',
 '6': '5. Avatar (tt0499549)',
 '7': '5. The Lone Ranger (tt1210819)',
 '8': '1. 1478',
 '9': '4. The Dark Knight (tt0468569)',
 '10': '5. The Lone Ranger (tt1210819)',
 '11': '3. Drama',
 '12': '1. Drama',
 '13': '5. Peter Jackson',
 '14': '3. Robert Rodriguez',
 '15': '3. Chris Hemsworth',
 '16': '3. Matt Damon',
 '17': '2. Action',
 '18': '1. K-19: The Widowmaker (tt0267626)',
 '19': '5. 2015',
 '20': '1. 2014',
 '21': '4. Сентябрь',
 '22': '2. 450',
 '23': '5. Peter Jackson',
 '24': '5. Four By Two Productions',
 '25': '3. Midnight Picture Show',
 '26': '1. Inside Out, The Dark Knight, 12 Years a Slave',
 '27': '5. Daniel Radcliffe & Rupert Grint'}

In [177]:
# и убедиться что ни чего не пропустил)
len(answers)

27